app/controllers/culerify_controller.rb

SELECT "culers".* FROM "culers"
---
  def index
    @culer = Culer.all

SELECT "culers".* FROM "culers" WHERE "culers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @culer = Culer.find(params[:id])

INSERT INTO "culers" ("name", "age", "country", "position", "kit_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", nil], ["age", nil], ["country", nil], ["position", nil], ["kit_number", nil], ["created_at", "2024-06-19 12:08:29.260105"], ["updated_at", "2024-06-19 12:08:29.260105"]]
---
  def create
    @culer = Culer.create(culer_params)

SELECT "culers".* FROM "culers" WHERE "culers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @culer = Culer.find(params[:id])

SELECT "culers".* FROM "culers" WHERE "culers"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "culers" SET "name" = ?, "age" = ?, "country" = ?, "position" = ?, "kit_number" = ?, "updated_at" = ? WHERE "culers"."id" = ?  [["name", "Update 2"], ["age", nil], ["country", ""], ["position", ""], ["kit_number", nil], ["updated_at", "2024-06-19 15:23:21.425059"], ["id", 7]]
---
  def update
    @culer = Culer.find(params[:id])

    @culer.update(culer_params)

SELECT "culers".* FROM "culers" WHERE "culers"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
DELETE FROM "culers" WHERE "culers"."id" = ?  [["id", 21]]
---
  def destroy
    @culer = Culer.find(params[:id])

    @culer.delete